"""
1. Поработайте с переменными, создайте несколько, выведите на экран,
запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
"""

# Запрос у пользователя целочисленной переменной с последующим выводом на экран
name = input("Введите Ваше имя: ")
age = int(input("Введите Ваш возраст: "))

print("Приятно познакомиться, ", name, ",", age, "летний человек")


# Вывод на экран результата логической операции с учетом изменения типа данных
my_var = int(input("Введите число: ")) + 5
print ("Результат сложения: ", my_var)